app/views/posts/index.html.erb

SELECT  1 AS one FROM "likes"  WHERE "likes"."user_id" = 1 AND "likes"."post_id" = 1 LIMIT 1
---
  <div class="like">
  <% if not Like.where(user_id:session[:user_id], post_id: post.id).exists? %>

SELECT COUNT(*) FROM "likes"  WHERE "likes"."post_id" = $1  [["post_id", 1]]
---
  <div class="like_count">
 <a href="bright_ideas/<%= post.id%>"><%= post.likes.count %> people</a> like this.
  </div>