app/controllers/likes_controller.rb

	def create
		@post = Post.where(user: params[:id])
		like = Like.create(user_id: session[:user_id], post_id: params[:post_id])
---
INSERT INTO "likes" ("created_at", "post_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-11-18 15:53:10.104180"], ["post_id", 2], ["updated_at", "2016-11-18 15:53:10.104180"], ["user_id", 1]]

	def show
		 @post = Post.find(params[:id])
		 @like = Like.where(post_id: params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "likes".* FROM "likes"  WHERE "likes"."post_id" IS NULL

	def destroy
		destroy = Like.where(user_id: session[:user_id]).where(post_id: params[:post_id])
		if !destroy
			flash[:errors] = "You cannot unlike that"
		else
			destroy.destroy_all
---
SELECT "likes".* FROM "likes"  WHERE "likes"."user_id" = 2 AND "likes"."post_id" IS NULL
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 29]]