app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
	def index
		@post = Post.all
		@like = Like.all
		@user = User.find(session[:user_id])

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "A hologram Phone!!!"], ["created_at", "2016-11-18 14:48:59.281906"], ["updated_at", "2016-11-18 14:48:59.281906"], ["user_id", 1]]
---
	def create
		post = Post.create(content: params[:New_post], user_id: session[:user_id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
	def destroy
	    post = Post.find(params[:id])
	    post.destroy if post.user == current_user