app/controllers/users_controller.rb

  def create

    @user = User.create(name: params[:name], alias:params[:alias], email: params[:email], password: params[:password], password_confirmation: params[:password_confirmation])
       if @user.errors.any?
---
INSERT INTO "users" ("alias", "created_at", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users"   ORDER BY "users"."id" DESC LIMIT 1
SELECT  1 AS one FROM "users"  WHERE LOWER("users"."email") = LOWER('') LIMIT 1

  def show
  	@user = User.find(params[:id])
    @post = Post.where(user_id: params[:id])
    @like = Like.where(user_id: params[:id])
    @count_posts = @post.count
    @count_likes = @like.count
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts"  WHERE "posts"."user_id" = 1
SELECT COUNT(*) FROM "posts"  WHERE "posts"."user_id" = 2
SELECT COUNT(*) FROM "likes"  WHERE "likes"."user_id" = 2